package com.oop_hw;

// 1. Создайте унаследованный класс ГорячийНапиток с дополнительным полем int температура.

// 2. Создайте класс АвтоматГорячихНапитков, реализующий интерфейс ТорговыйАвтомат и реализуйте перегруженный метод getProduct(int name, int volume, int temperature), выдающий продукт, соответствующий имени, объему и температуре.

// 3. В main проинициализируйте несколько ГорячихНапитков и АвтоматГорячихНапитков и позвольте покупателю купить товар.

public class App {
    public static void main(String[] args) {

    }
}
